myinit.org
#+STARTIP: overview

This file is called from ~init.el~ which has the definition of the MELPA repository and  ~use-package~ to install all of the packages

* Set default tweaks

  #+BEGIN_SRC emacs-lisp
    ;; Sets default directory
    (setq default-directory "~/")
    ;; Inhibits the Emacs startup message w/ tutorial, etc..
    (setq inhibit-startup-message t)
    (tool-bar-mode -1)

    ;; Whenever emacs asks for yes or no, just y or n
    (fset 'yes-or-no-p 'y-or-n-p)

    ;; Reload buffer without reopening with F5
    (global-set-key (kbd "<f5>") 'revert-buffer)

    ;; Start emacs with full screen
    (add-to-list 'default-frame-alist '(fullscreen . maximized))

    ;; Show line numbering on all buffers
    ;; Ideally, I'd like only line numbering
    ;; on the left buffers but I don't know
    ;; how to do it.
    (global-display-line-numbers-mode)

    ;; To highlight complementary parenthesis when cursor is on top
    (show-paren-mode 1)
    (setq show-paren-delay 0)
    (setq org-src-tab-acts-natively t)

    ;; Set lines to continue if they're too long instead of
    ;; continuing them in the next line
    (setq-default truncate-lines t)
    ;; (setq toggle-truncate-lines t)
    ;; (setq truncate-partial-width-windows nil)

    ;; Remaps kill this buffer to familiar CTRL + W
    (global-set-key [(control w)] 'kill-this-buffer)
    (global-set-key (kbd "M-k")  'kill-region)
    (global-set-key (kbd "M-k")  'kill-region)
  #+END_SRC

* Save all temporary files in auto-save
** Saves backup and auto-save in temporary directory

   #+BEGIN_SRC emacs-lisp
     ;; store all backup and autosave files in the tmp dir
     (setq backup-directory-alist
	   `((".*" . ,temporary-file-directory)))
     (setq auto-save-file-name-transforms
	   `((".*" ,temporary-file-directory t)))

     (setq-default auto-save-default t)

   #+END_SRC

* Install try
** Package to try packages for only that session
   #+BEGIN_SRC emacs-lisp
     (use-package try
       :ensure t)
   #+END_SRC

* Auto completion 
** Enable ido package to make auto-completion better for completing commands in mini-buffer
   #+BEGIN_SRC emacs-lisp
     (setq indo-enable-flex-matching t)
     (setq indo-everywhere t)
     (setq ido-create-new-buffer 'always)
     (ido-mode 1)
   #+END_SRC

** which-key helps to auto-complete commands in mini-buffer. Type C-c and allow 2 seconds to pass, a pop up menu shows you possible keys
   #+BEGIN_SRC emacs-lisp
     (use-package which-key
       :ensure t
       :config (which-key-mode))
   #+END_SRC

** smart-parens for completing parenthesis brackets, etc..
   #+BEGIN_SRC emacs-lisp
     (use-package smartparens
       :ensure t
       :config (smartparens-global-mode t))

     ;; To highlight some text and press * to wrap it in * *
     (sp-with-modes '(org-mode)
       (sp-local-pair "*" "*"))

   #+END_SRC

* Adds 80 character line tweaks
  #+BEGIN_SRC emacs-lisp

    (setq-default
     whitespace-line-column 80
     whitespace-style       '(face lines-tail))

    (add-hook 'prog-mode-hook #'whitespace-mode)

    (setq-default fill-column 80)

  #+END_SRC
* org-mode
** Installs and loads org-mode + adds flyspell for spell-checking
   - See http://pragmaticemacs.com/emacs/check-and-fix-spelling-as-you-type/ for the spell-checking part. I've removed flyspell because it needs to be installed in the computer
   #+BEGIN_SRC emacs-lisp
     (use-package org-bullets
       :ensure t
       :config
       (add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))
     ;;        (add-hook 'text-mode-hook 'flyspell-mode))

     (use-package org
       :bind (:map org-mode-map
		   ("M-n" . eval-region)))

     (with-eval-after-load 'org
       (bind-key "M-n" #'eval-region org-mode-map))

   #+END_SRC

** Adds languages to org-mode

   #+BEGIN_SRC emacs-lisp
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((R . t)))

   #+END_SRC

** Setup org-mode
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-c l") 'org-store-link)
     (global-set-key (kbd "C-c c") 'org-capture)
     (global-set-key (kbd "C-c a") 'org-agenda)
     (global-set-key (kbd "C-c b") 'org-switchb)

     (setq org-todo-keywords'
	   ((sequence "TODO" "IN PROCESS" "WAITING" "|" "DONE"))
	   )

     ;; To archive all TODO's in an org file.
     ;; Taken from https://stackoverflow.com/questions/6997387/how-to-archive-all-the-done-tasks-using-a-single-command/27043756#27043756
     (defun org-archive-done-tasks ()
       (interactive)
       (org-map-entries
	(lambda ()
	  (org-archive-subtree)
	  (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
	"/DONE" 'file))

     (global-set-key (kbd "C-x C-a C-a") 'org-archive-done-tasks)

     ;; Sets a closed timestamp
     (setq org-log-done 'time)

     ;; Prompts for a note after TODO is set to DONE
     (setq org-log-done 'note)
#+END_SRC

** Setup org-agenda
#+BEGIN_SRC emacs-lisp
  ;; (defun cj-org-agenda-show-agenda-and-todo (&optional arg)
  ;;   (interactive "P")
  ;;   (org-agenda arg "n"))

 
  ;; (define-key global-map (kbd "C-c a") 'cj-org-agenda-show-agenda-and-todo)

  (setq org-agenda-files
	(list "~/google_drive/gtd/inbox.org" "~/google_drive/gtd/gcal.org"))

#+END_SRC


** org-capture templates
#+BEGIN_SRC emacs-lisp

  (setq org-capture-templates
	'(("a" "Appointment" entry (file  "~/google_drive/gtd/gcal.org" )
	   "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
	  ("t" "To Do Item" entry (file+headline "~/google_drive/gtd/inbox.org" "To Do")
	   "* TODO %?\n%u" :prepend t)))


#+END_SRC

** Insert today's date
#+BEGIN_SRC emacs-lisp
  ;; from http://emacswiki.org/emacs/InsertingTodaysDate
  (defun insert-todays-date (arg)
    (interactive "P")
    (insert (if arg
		(format-time-string "%d-%m-%Y")
	      (format-time-string "%Y-%m-%d"))))
#+END_SRC
* On startup
Do not move this to the front because I do stuff in ~~org-mode~~ which affects org files
** Open inbox
#+BEGIN_SRC emacs-lisp
    ;; ;; On startup open TODO list
    (find-file "~/google_drive/gtd/inbox.org")
#+END_SRC
* List buffers
** Switch list-buffer to ibuffer
 #+BEGIN_SRC emacs-lisp
   (defalias 'list-buffers 'ibuffer)
 #+END_SRC
** Package to place numbers on the windows to switch quicker
 #+BEGIN_SRC emacs-lisp
   (use-package ace-window
     :ensure t
     :init
     (progn
       (global-set-key [remap other-window] 'ace-window)
       (custom-set-faces
	'(aw-leading-char-face
	  ((t (:inherit- ace-jump-face-foreground :height 3.0)))))
       ))
 #+END_SRC

* org-ref
** Package to handle references and notes in literature reviews
 #+BEGIN_SRC emacs-lisp
   (use-package org-ref
     :ensure t
     :config
     (setq reftex-default-bibliography '("~/google_drive/literature/references.bib")
	   org-ref-bibliography-notes "~/google_drive/literature/notes.org"
	   org-ref-default-bibliography  '("~/google_drive/literature/references.bib")
	   org-ref-pdf-directory "~/google_drive/literature/pdfs/"))
 #+END_SRC

* YAML mode
#+BEGIN_SRC emacs-lisp

(use-package yaml-mode
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))

#+END_SRC
* Searching in Emacs
** swiper
#+BEGIN_SRC emacs-lisp
  ;; counsel is used by swiper so install before
  (use-package counsel
    :ensure t
    :bind
    (("M-y" . counsel-yank-pop)
     :map ivy-minibuffer-map
     ("M-y" . ivy-next-line))
    )

  (use-package swiper
    :ensure t
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (setq enable-recursive-minibuffers t)
      ;; enable this if you want `swiper' to use it
      ;; (setq search-default-mode #'char-fold-to-regexp)
      (global-set-key "\C-s" 'swiper)
      (global-set-key (kbd "C-c C-r") 'ivy-resume)
      (global-set-key (kbd "<f6>") 'ivy-resume)
      (global-set-key (kbd "M-x") 'counsel-M-x)
      (global-set-key (kbd "C-x C-f") 'counsel-find-file)
      (global-set-key (kbd "<f1> f") 'counsel-describe-function)
      (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
      (global-set-key (kbd "<f1> l") 'counsel-find-library)
      (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
      (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
      (global-set-key (kbd "C-c g") 'counsel-git)
      (global-set-key (kbd "C-c j") 'counsel-git-grep)
      (global-set-key (kbd "C-c k") 'counsel-ag)
      (global-set-key (kbd "C-x l") 'counsel-locate)
      (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
      (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
      ))
#+END_SRC

** avy for moving quickly in a file
#+BEGIN_SRC emacs-lisp
  ;; avy for moving quickly through files
  (use-package avy
    :ensure t
    :bind ("M-s" . avy-goto-char-2))
#+END_SRC

* Emacs theme
** Spacemacs: used this before, keeping here if want to come back

 #+BEGIN_SRC emacs-lisp
   ;; Set spacemacs theme
   ;; This is a bit weird because the package is actually 'spacemacs-theme'
   ;; but I can't find it on MELPA through emacs (although it is on melpa.org)
   ;; However, this ewal-spacemacs-themes seems to work
   ;; (use-package ewal-spacemacs-themes
   ;;   :ensure t
   ;;   :config (load-theme 'spacemacs-dark t))
 #+END_SRC

** moe-theme: used this before, keeping here if want to come back
  #+BEGIN_SRC emacs-lisp

    ;; (use-package moe-theme
    ;;   :ensure t
    ;;   :config
    ;;   (setq moe-theme-highlight-buffer-id t)
    ;;   (moe-dark))

    ;; (set-face-attribute 'default nil :font "Monaco-13")

  #+END_SRC
