myinit.el
;; Sets default directory
(setq default-directory "~/")
;; Inhibits the Emacs startup message w/ tutorial, etc..
(setq inhibit-startup-message t)
(tool-bar-mode -1)

;; Whenever emacs asks for yes or no, just y or n
(fset 'yes-or-no-p 'y-or-n-p)

;; Reload buffer without reopening with F5
(global-set-key (kbd "<f5>") 'revert-buffer)

;; Start emacs with full screen
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; Show line numbering on all buffers
;; Ideally, I'd like only line numbering
;; on the left buffers but I don't know
;; how to do it.
(global-display-line-numbers-mode)

;; To highlight complementary parenthesis when cursor is on top
(show-paren-mode 1)
(setq show-paren-delay 0)

(setq org-src-tab-acts-natively t)

;; On startup open TODO list
(find-file "~/google_drive/gtd/inbox.org")

;; store all backup and autosave files in the tmp dir
  (setq backup-directory-alist
	`((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
	`((".*" ,temporary-file-directory t)))

(use-package try
  :ensure t)

(setq indo-enable-flex-matching t)
(setq indo-everywhere t)
(setq ido-create-new-buffer 'always)
(ido-mode 1)

(use-package which-key
  :ensure t
  :config (which-key-mode))

(use-package smartparens
  :ensure t
  :config (smartparens-global-mode t))

(use-package org-bullets
	:ensure t
	:config
	(add-hook 'org-mode-hook (lambda() (org-bullets-mode 1))))
;;        (add-hook 'text-mode-hook 'flyspell-mode))



(defalias 'list-buffers 'ibuffer)

(use-package ace-window
  :ensure t
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit- ace-jump-face-foreground :height 3.0)))))
    ))

(use-package org-ref
  :ensure t
  :config
  (setq reftex-default-bibliography '("~/google_drive/literature/references.bib")
	org-ref-bibliography-notes "~/google_drive/literature/notes.org"
	org-ref-default-bibliography  '("~/google_drive/literature/references.bib")
	org-ref-pdf-directory "~/google_drive/literature/pdfs/"))

(use-package yaml-mode
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))

;; counsel is used by swiper so install before
(use-package counsel
  :ensure t
  )

(use-package swiper
  :ensure t
  :config
  (progn
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    ;; enable this if you want `swiper' to use it
    ;; (setq search-default-mode #'char-fold-to-regexp)
    (global-set-key "\C-s" 'swiper)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-c g") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
    (global-set-key (kbd "C-x l") 'counsel-locate)
    (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
    (define-key minibuffer-local-map (kbd "C-r") 'counsel-minibuffer-history)
    ))

;; avy for moving quickly through files
(use-package avy
  :ensure t
  :bind ("M-s" . avy-goto-char-2))

;; Set spacemacs theme
;; This is a bit weird because the package is actually 'spacemacs-theme'
;; but I can't find it on MELPA through emacs (although it is on melpa.org)
;; However, this ewal-spacemacs-themes seems to work
;; (use-package ewal-spacemacs-themes
;;   :ensure t
;;   :config (load-theme 'spacemacs-dark t))

(use-package moe-theme
  :ensure t
  :config
  (setq moe-theme-highlight-buffer-id t)
  (moe-dark))

(set-face-attribute 'default nil :font "Monaco-13")
