myinit.org
** Doom theme: current 
#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :ensure t)

  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled

  ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
  ;; may have their own settings.
  (load-theme 'doom-dracula t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)

  ;; Taken partially from https://github.com/ianpan870102/.personal-emacs.d/blob/master/init.el
  ;; START HERE

  ;; (use-package spacemacs-common
  ;;   :ensure spacemacs-theme
  ;;   :custom-face
  ;;   (line-number              ((t (:foreground "#414B4f" :background "#282B2E"))))
  ;;   (line-number-current-line ((t (:foreground "#616B6f" :background "#282B2E"))))
  ;;   (highlight-symbol-face    ((t (:background "#44444f"))))
  ;;   :custom
  ;;   (spacemacs-theme-comment-bg nil)
  ;;   (spacemacs-theme-comment-italic t)
  ;;   :config
  ;;   (load -theme 'spacemacs-dark t))

  (use-package solaire-mode
    :ensure t
    :hook (((change-major-mode after-revert ediff-prepare-buffer) . turn-on-solaire-mode)
	   (minibuffer-setup . solaire-mode-in-minibuffer))
    :config
    (solaire-mode-swap-bg)
    (solaire-global-mode +1))

  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode)
    :custom
    (inhibit-compacting-font-caches t)
    (doom-modeline-buffer-file-name-style 'relative-from-project)
    (doom-modeline-bar-width 1)
    (doom-modeline-modal-icon nil)
    (doom-modeline-height 15)
    (doom-modeline-env-python-executable "python3")
    :config
    (when (member "Menlo" (font-family-list))
      (set-face-attribute 'mode-line nil :height 110 :font "Menlo")
      (set-face-attribute 'mode-line-inactive nil :height 110 :font "Menlo")))

  (use-package all-the-icons
    :ensure t
    :custom
    (all-the-icons-scale-factor 1.0)
    (all-the-icons-install-fonts))

  (use-package all-the-icons-ivy
    :ensure t
    :hook (after-init . all-the-icons-ivy-setup)
    :custom
    (all-the-icons-ivy-buffer-commands '()))

  (use-package all-the-icons-dired
    :ensure t
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; (use-package centaur-tabs
  ;;   :demand
  ;;   :bind (("C-S-<tab>" . centaur-tabs-backward)
  ;; 	 ("C-<tab>" . centaur-tabs-forward)
  ;; 	 ("C-x p" . centaur-tabs-counsel-switch-group))
  ;;   :custom
  ;;   (centaur-tabs-set-bar 'under)
  ;;   (x-underline-at-descent-line t)
  ;;   (centaur-tabs-set-modified-marker t)
  ;;   (centaur-tabs-modified-marker " ● ")
  ;;   (centaur-tabs-cycle-scope 'tabs)
  ;;   (centaur-tabs-height 30)
  ;;   (centaur-tabs-set-icons t)
  ;;   (centaur-tabs-close-button " × ")
  ;;   :config
  ;;   (centaur-tabs-mode +1)
  ;;   (centaur-tabs-headline-match)
  ;;   (centaur-tabs-group-by-projectile-project)
  ;;   (when (member "Arial" (font-family-list))
  ;;     (centaur-tabs-change-fonts "Arial" 130)))

  ;; (use-package highlight-symbol
  ;;   :ensure t
  ;;   :hook (prog-mode . highlight-symbol-mode)
  ;;   :custom
  ;;   (high light-symbol-idle-delay 0.3))

  (use-package highlight-numbers
    :ensure t
    :hook (prog-mode . highlight-numbers-mode))

  (use-package highlight-operators
    :ensure t
    :hook (prog-mode . highlight-operators-mode))

  (use-package highlight-escape-sequences
    :ensure t
    :hook (prog-mode . hes-mode))
  ;; END HERE

 #+END_SRC

* Projectile
#+BEGIN_SRC emacs-lisp
  ;; If you find an error, ag needs to be installed from terminal as well.
  ;; homebrew install the_silver_searcher for macs
  ;; sudo apt-get install silversearcher-ag from ubuntu

  ;; Helm search for projectile. Allows to search for files within a project
  (use-package helm-projectile
    :ensure t
    :config
    (helm-projectile-on))

  ;; Needed by helm-projectile for esearch
  (use-package helm-ag
    :ensure t)

  (use-package projectile
    :ensure t
    :bind ("C-c p" . projectile-command-map)
    :config
    (projectile-global-mode)
    (setq projectile-completion-system 'helm)
    (setq projectile-switch-project-action 'helm-projectile))
  (projectile-discover-projects-in-directory "~/repositories/")

  ;; (use-package counsel-projectile
  ;; :ensure t
  ;; :config
  ;; ;; (counsel-projectile-mode))

#+END_SRC
* ESS for statistics
** Load ESS
 #+BEGIN_SRC emacs-lisp
   (use-package ess
     :ensure t
     :config
     ;; Add latex symbol completion in julia buffer mode as well.
     (add-hook 'ess-julia-mode-hook
	       (lambda()
		 (add-hook 'completion-at-point-functions
			   'ess-julia-latexsub-completion nil 'local)))
     (setq tab-always-indent 'complete))

 #+END_SRC

** Set different modes in ESS
#+BEGIN_SRC emacs-lisp

  (use-package poly-R
    :ensure t)

  (use-package poly-markdown
    :ensure t)

  ;;; R modes
  (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.Snw" . poly-noweb+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rnw" . poly-noweb+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))
  (add-to-list 'auto-mode-alist '("\\.rmd" . poly-markdown+r-mode))

  ;; Export files with the same name as the main file
  ;; Taken from https://github.com/karawoo/prelude/blob/db60a8e448757b1e07b7323e411c3d5d4d1b7d45/personal/custom.el#L751-L752
  (setq polymode-exporter-output-file-format "%s")

#+END_SRC
** Tweaks to ESS config
#+BEGIN_SRC emacs-lisp
  ;; Don't restore history or save on exit
  (setq-default inferior-R-args "--no-restore-history --no-save")

  (setq ess-ask-for-ess-directory nil)

  ;; ESS doesn't slow down Emacs
  ;; (setq ess-eval-visibly 'nowait) ;; in 12.09-1
  (setq ess-eval-visibly nil)
  (setq ess-eval-visibly-p nil)
  ;; Smartparens in R repl.
  (add-hook 'ess-R-post-run-hook (lambda () (smartparens-mode 1)))
  (add-hook 'inferior-ess-mode-hook (lambda () (smartparens-mode 1)))

  ;; Set the style to RStudio. This gives me stuff like tab spaces are 2 spaces not 4
  (setq ess-default-style 'RStudio)
#+END_SRC

** Forces help to appear only on R script
#+BEGIN_SRC emacs-lisp
;; Doesn't work until now. I think the variable display-buffer-alist
  (setq display-buffer-alist
	'(("*R*"
	   nil
	   (dedicated . t))))

#+END_SRC
** Auto-completion in ESS
#+BEGIN_SRC emacs-lisp
  ;; Set up company, i.e. code autocomplete
  (use-package company
    :ensure t
    :config
    ;; Enable company mode everywhere
    (add-hook 'after-init-hook 'global-company-mode)
    )

  ;; Set up TAB to manually trigger autocomplete menu
  (define-key company-mode-map (kbd "TAB") 'company-complete)
  (define-key company-active-map (kbd "TAB") 'company-complete-common)
  ;; Set up M-h to see the documentation for items on the autocomplete menu
  (define-key company-active-map (kbd "M-h") 'company-show-doc-buffer)

  ;; If you would want to have the help pop ups in company mode
  ;; (use-package company-quickhelp
  ;;   :ensure t
  ;;   :config
  ;;   (company-quickhelp-mode))

  ;;   (use-package auto-complete
  ;;     :ensure t
  ;;     :init
  ;;     (progn
  ;;       (ac-config-default)
  ;;       (global-auto-complete-mode t)
  ;;       ))

  ;;   ;; To allow for TAB completion
  ;;   ;; https://stackoverflow.com/questions/49232454/emacs-ess-how-to-auto-complete-library-function
  ;;   (use-package company
  ;;     :ensure t
  ;;     :init (require 'company))

  ;;   (setq tab-always-indent 'complete)

  ;;   (setq company-idle-delay 0.5
  ;; 	company-show-numbers t
  ;; 	company-minimum-prefix-length 2
  ;; 	company-tooltip-flip-when-above t)

  ;;   (global-set-key (kbd "C-M-/") #'company-complete)
  ;;   (global-company-mode)
  ;;   (defun my-ess-hook ()
  ;;     ;; ensure company-R-library is in ESS backends
  ;;     (make-local-variable 'company-backends)
  ;;     (cl-delete-if (lambda (x) (and (eq (car-safe x) 'company-R-args))) company-backends)
  ;;     (push (list 'company-R-args 'company-R-objects 'company-R-library :separate)
  ;; 	  company-backends))
  ;; 	  (add-hook 'ess-mode-hook 'my-ess-hook)
  ;; 	  (with-eval-after-load 'ess
  ;;     (setq ess-use-company t))

#+END_SRC
** Pipe operator shortcut
#+BEGIN_SRC emacs-lisp
  ;; Taken from https://github.com/karawoo/prelude/blob/db60a8e448757b1e07b7323e411c3d5d4d1b7d45/personal/custom.el
  ;; %>% shortcut
  ;; http://emacs.stackexchange.com/a/8055/7060
  (defun then_R_operator ()
    "R - %>% operator or 'then' pipe operator"
    (interactive)
    (insert " %>% "))
  (define-key ess-mode-map (kbd "C->") 'then_R_operator)
  (define-key inferior-ess-mode-map (kbd "C->") 'then_R_operator)
#+END_SRC

** Assign operator shortcut
#+BEGIN_SRC emacs-lisp
  (defun assign_R_operator ()
    "R - Insert <- operator"
    (interactive)
    (insert " <- "))
  (define-key ess-mode-map (kbd "C-<") 'assign_R_operator)
  (define-key inferior-ess-mode-map (kbd "C-<") 'assign_R_operator)
#+END_SRC

** Make Shift-Enter do a lot in ESS
#+BEGIN_SRC emacs-lisp

  (add-hook 'inferior-ess-mode-hook
      '(lambda nil
	    (define-key inferior-ess-mode-map [\C-up]
		'comint-previous-matching-input-from-input)
	    (define-key inferior-ess-mode-map [\C-down]
		'comint-next-matching-input-from-input)
	    (define-key inferior-ess-mode-map [\C-x \t]
		'comint-dynamic-complete-filename)
       )
   )

  (setq ess-ask-for-ess-directory nil)
    (setq ess-local-process-name "R")
    (setq ansi-color-for-comint-mode 'filter)
    (setq comint-scroll-to-bottom-on-input t)
    (setq comint-scroll-to-bottom-on-output t)
    (setq comint-move-point-for-output t)

    (defun my-ess--R ()
      (interactive)
      (if (not (member "*R*" (mapcar (function buffer-name) (buffer-list))))
	(progn
	  (delete-other-windows)
	  (setq w1 (selected-window))
	  (setq w1name (buffer-name))
	  (setq w2 (split-window w1 nil t))
	  (R)
	  (set-window-buffer w2 "*R*")
	  (set-window-buffer w1 w1name))))
#+END_SRC

** Scratch script R
#+BEGIN_SRC emacs-lisp
  (defun R-scratch ()
    (interactive)
    (progn
      (delete-other-windows)
      (setq new-buf (get-buffer-create "scratch.R"))
      (switch-to-buffer new-buf)
      (R-mode)
      (setq w1 (selected-window))
      (setq w1name (buffer-name))
      (setq w2 (split-window w1 nil t))
      (if (not (member "*R*" (mapcar (function buffer-name) (buffer-list))))
	  (R))
      (set-window-buffer w2 "*R*")
      (set-window-buffer w1 w1name)))

  (global-set-key (kbd "C-x 9") 'R-scratch)

#+END_SRC

** Add Shiny shortcut
#+BEGIN_SRC emacs-lisp
  (defun ess-r-shiny-run-app (&optional arg)
    "Interface for `shiny::runApp()'.
     With prefix ARG ask for extra args."
    (interactive)
    (inferior-ess-r-force)
    (ess-eval-linewise
     "shiny::runApp(\".\")\n" "Running app" arg
     '("" (read-string "Arguments: " "recompile = TRUE"))))
#+END_SRC

** Insert RMarkdown chunk
#+BEGIN_SRC emacs-lisp

(defun new-chunk (header)
  "Insert an r-chunk in markdown mode. Necessary due to interactions between polymode and yasnippet"
  (interactive "sHeader: ")
  (insert (concat "```{r " header "}\n\n```"))
  (forward-line -1))

#+END_SRC

