myinit.el

;; If you find an error, ag needs to be installed from terminal as well.
;; homebrew install the_silver_searcher for macs
;; sudo apt-get install silversearcher-ag from ubuntu

  ;; Helm search for projectile. Allows to search for files within a project
  (use-package helm-projectile
    :ensure t
    :config
    (helm-projectile-on))
  
  ;; Needed by helm-projectile for esearch
  (use-package helm-ag
    :ensure t)

  (use-package projectile
    :ensure t
    :bind ("C-c p" . projectile-command-map)
    :config
    (projectile-global-mode)
  (setq projectile-completion-system 'helm)
  (setq projectile-switch-project-action 'helm-projectile))


    ;; (use-package counsel-projectile
    ;; :ensure t
    ;; :config
    ;; ;; (counsel-projectile-mode))

(use-package ess
  :ensure t
  :init (require 'ess-site))

;; Don't restore history or save on exit
(setq-default inferior-R-args "--no-restore-history --no-save")

;; Smartparens in R repl.
(add-hook 'ess-R-post-run-hook (lambda () (smartparens-mode 1)))
(add-hook 'inferior-ess-mode-hook (lambda () (smartparens-mode 1)))

;; Set the style to RStudio. This gives me stuff like tab spaces are 2 spaces not 4
(setq ess-default-style 'RStudio)

(use-package auto-complete
  :ensure t
  :init
  (progn
    (ac-config-default)
    (global-auto-complete-mode t)
    ))

;; To allow for TAB completion
;; https://stackoverflow.com/questions/49232454/emacs-ess-how-to-auto-complete-library-function
(use-package company
  :ensure t
  :init (require 'company))

(setq tab-always-indent 'complete)

(setq company-idle-delay 0.5
      company-show-numbers t
      company-minimum-prefix-length 2
      company-tooltip-flip-when-above t)

(global-set-key (kbd "C-M-/") #'company-complete)
(global-company-mode)
(defun my-ess-hook ()
  ;; ensure company-R-library is in ESS backends
  (make-local-variable 'company-backends)
  (cl-delete-if (lambda (x) (and (eq (car-safe x) 'company-R-args))) company-backends)
  (push (list 'company-R-args 'company-R-objects 'company-R-library :separate)
	company-backends))
	(add-hook 'ess-mode-hook 'my-ess-hook)
	(with-eval-after-load 'ess
  (setq ess-use-company t))

;; Taken from https://github.com/karawoo/prelude/blob/db60a8e448757b1e07b7323e411c3d5d4d1b7d45/personal/custom.el
;; %>% shortcut
;; http://emacs.stackexchange.com/a/8055/7060
(defun then_R_operator ()
  "R - %>% operator or 'then' pipe operator"
  (interactive)
  (insert " %>% "))
(define-key ess-mode-map (kbd "C->") 'then_R_operator)
(define-key inferior-ess-mode-map (kbd "C->") 'then_R_operator)

(defun assign_R_operator ()
  "R - Insert <- operator"
  (interactive)
  (insert " <- "))
(define-key ess-mode-map (kbd "C-<") 'assign_R_operator)
(define-key inferior-ess-mode-map (kbd "C-<") 'assign_R_operator)

(setq ess-ask-for-ess-directory nil)
(add-hook 'inferior-ess-mode-hook
    '(lambda nil
	  (define-key inferior-ess-mode-map [\C-up]
	      'comint-previous-matching-input-from-input)
	  (define-key inferior-ess-mode-map [\C-down]
	      'comint-next-matching-input-from-input)
	  (define-key inferior-ess-mode-map [\C-x \t]
	      'comint-dynamic-complete-filename)
     )
 )

(setq ess-ask-for-ess-directory nil)
  (setq ess-local-process-name "R")
  (setq ansi-color-for-comint-mode 'filter)
  (setq comint-scroll-to-bottom-on-input t)
  (setq comint-scroll-to-bottom-on-output t)
  (setq comint-move-point-for-output t)

  (defun my-ess-start-R ()
    (interactive)
    (if (not (member "*R*" (mapcar (function buffer-name) (buffer-list))))
      (progn
	(delete-other-windows)
	(setq w1 (selected-window))
	(setq w1name (buffer-name))
	(setq w2 (split-window w1 nil t))
	(R)
	(set-window-buffer w2 "*R*")
	(set-window-buffer w1 w1name))))

(defun R-scratch ()
  (interactive)
  (progn
    (delete-other-windows)
    (setq new-buf (get-buffer-create "scratch.R"))
    (switch-to-buffer new-buf)
    (R-mode)
    (setq w1 (selected-window))
    (setq w1name (buffer-name))
    (setq w2 (split-window w1 nil t))
    (if (not (member "*R*" (mapcar (function buffer-name) (buffer-list))))
	(R))
    (set-window-buffer w2 "*R*")
    (set-window-buffer w1 w1name)))

(global-set-key (kbd "C-x 9") 'R-scratch)

(defun ess-r-shiny-run-app (&optional arg)
  "Interface for `shiny::runApp()'.
   With prefix ARG ask for extra args."
  (interactive)
  (inferior-ess-r-force)
  (ess-eval-linewise
   "shiny::runApp(\".\")\n" "Running app" arg
   '("" (read-string "Arguments: " "recompile = TRUE"))))
